app/Views/list/lista_estoques.php

        <td> <?= $estoque->ID_ESTOQUE ?> </td>
        <td> <?= $estoque->DATA_ENTRADA ?> </td>
        <td> <?= $estoque->QUANTIDADE_ENTRADA ?> </td>
        <td> <?= $produto->where("ID_PRODUTO", $estoque->ID_PRODUTO)->findAll()[0]->NOME_PRODUTO ?> </td>
---
SELECT *
FROM `PRODUTO`
WHERE `ID_PRODUTO` = '1'